(function (){//test № 5
const a=[
{ask:'Предпринимательство - это',
o:[
'*деятельность человека направленная на максимизацию прибыли',
'добровольная деятельность человека, который, пользуясь либо распоряжаясь экономическими благами, самостоятельно или с привлечением наемного труда, предпринимает меры по производству нового продукта с целью получения дохода',
'принудительная деятельность экономического агента, нацеленная на получение прибыли и дохода путем эффективного сочетания ограниченных ресурсов',
'процесс создания дополнительной стоимости в экономических системах',
'процесс создания предприятий, занимающихся экономической деятельностью для удовлетворения потребностей населения',]},

{ask:'как называется энергичный предприниматель с положительной социальной ориентацией',
o:[
'*дельфин',
'рак',
'акула',]},

{ask:'ип-предпринимательство регистрируется в форме',
o:[
'в любой',
'юридическое лицо',
'*физическое лицо',]},

{ask:'предпосылки предопределяющие становление предпринимательства в России',
o:[
'политические, экономические, социальные',
'*политические экономические юридические психологические',
'политические экономические юридические культурные',]},

{ask:'отметьте один из побудительных мотивов деятельности предпринимателя, выделенных шум',
o:[
'*внедрение инноваций',
'радость',
'потребность в господстве, влиянии',]},

{ask:'целью предпринимательства является',
o:[
'создание рабочих мест',
'*конечной целью является не столько прибыль, сколько непрерывность воспроизводственного процесса, связанного с воспроизводством спроса и удовлетворением постоянно меняющихся возрастающих потребностей индивидуума или социальной группы, общества в целом',
'производство нового продукта в условиях риска',
'удовлетворение спроса населения',
'получение прибыли',]},

{ask:'что из этого не относится к стимулам к началу собственного дела',
o:[
'желание раскрыть свои способности',
'продолжение семейных традиций',
'*накопленные личные сбережения',
'стремление к личной независимости',
'возможность выполнять любимую работу в удобное для себя время',]},

{ask:'что является документом закрепляющим необходимые условия для реализации коммерческой сделки',
o:[
'*контракт',
'сертификат о качестве товара',
'расчет цены товара',
'годовой отчет',
'сертификат об оказании услуг',]},

{ask:'целью предпринимательства является',
o:[
'пополнение бюджета государства налогами',
'*систематическое получение прибыли',
'удовлетворение потребностей населения в товарах и услугах',]},

{ask:'что из этого не является особенностью предпринимательской деятельности',
o:[
'предпринимательство - это процесс создания чего-то нового, вечный поиск улучшения своего положения, форм и методов развития',
'развитие творческого потенциала работников',
'*одна из организационно правовых форм предприятий',
'неотъемлемая часть национальной экономики',
'неотъемлемая часть хозяйственной деятельности предприятий',]},

{ask:'к предпринимательству не относится деятельность',
o:[
'*эмиссия ценных бумаг и торговля ими',
'торговля продуктами питания',
'организация регулярных пассажирских перевозок',]},

{ask:'формы предпринимательства',
o:[
'индивидуальное, совместное',
'частное, общее, государственное',
'*индивидуальное, партнерское, корпоративное',]},

{ask:'отметь разновидность посредников в финансовом предпринимательстве',
o:[
'представители',
'агенты',
'*маклеры',]},

{ask:'субъектами предпринимательства являются',
o:[
'*физические и юридические лица ',
'физические лица',
'юридические лица',]},

{ask:'какая из функций не является функцией предпринимательства',
o:[
'творческо-поисковая(инновационная) функция',
'*контрольная',
'маркетинговая',
'общеэкономическая',
'ресурсная',]},

{ask:'каковы недостатки акционерной формы хозяйства',
o:[
'легкость управления',
'*обязательства бессрочной выплаты дивидендов',
'число участников не должно быть менее 5',]},

{ask:'что не является характерной чертой предпринимательской деятельности',
o:[
'создание рабочих мест для населения живущего в окрестностях предприятия',
'экономическая заинтересованность, преследующая цель получение прибыли',
'самостоятельность и независимость хозяйствующих субъектов действующих в рамках правовых норм',
'*творческий потенциал общества',
'обеспечение персонала зп',]},

{ask:'посредники в коммерческом предпринимательстве',
o:[
'брокеры',
'*дилеры',
'маклеры',]},

{ask:'малоэнергичный предприниматель с отрицательной социальной ориентацией',
o:[
'дельфин',
'акула',
'*рак',]},

{ask:'недостатки акционерной формы хозяйствования',
o:[
'громоздкость управления',
'*ответственность участников АО своим имуществом',
'число участников не менее 5',]},

{ask:'количество волн выделяют в развитии научного осмысления практики предпринимательства:',
o:[
'*3',
'2',
'4',]},

{ask:'важнейшая черта предпринимательства',
o:[
'*риск и неопределенность, самостоятельность и свобода деятельности, опора на инновации',
'постоянный поиск новых идей, риск, экономически зависимость от макроэкономической ситуации',
'самостоятельность, оглядка на конкурентов, опора на инновации',]},

{ask:'хозяйственная операция сельского предпринимателя, которая относится к производственному предпринимательству',
o:[
'рекламная деятельность',
'*ремонтно-строительные работы в животноводстве',
'плата процентов за краткосрочный кредит',]},

{ask:'человек, профессионально осуществляющий организационную управленческую деятельность это',
o:[
'предприниматель',
'работодатель',
'руководитель',
'*менеджер',
'бригадир',]},

{ask:'недостаток ип',
o:[
'финансово-экономическая уязвимость бизнеса сориентированного на одного человека',
'*необходимость выполнять несколько производственно-хозяйственная функций одному человеку',
'наличие основных и дополнительных участников в форме хозяйствования',]},

{ask:'что не выражает проявления предпринимательских возможностей',
o:[
'разработка новых технологий изделий для удовлетворения имеющихся потребностей',
'поиск новых людей являющихся носителями новых идей',
'*умение оценить выгодность и перспективность дела',
'созданием спец подразделений для выполнения рискованных проектов',
'поиск наиболее эффективных способов удовлетворения существующих потребностей',]},

{ask:'ключевые слова характеризующие предпринимательство',
o:[
'*риск прибыль инициатива инновации',
'конкуренция прибыль налоги',
'риск прибыль потребности конкуренция',]},

{ask:'один из побудительных мотивов деятельности предпринимателя , по шуму',
o:[
'*стремление к успеху',
'потребность в господстве',
'получение максимальной прибыли',]},

{ask:'за унитарным предприятием закрепляется имущество на правах',
o:[
'собственности',
'*оперативного управления либо хозяйственного ведения',
'долгосрочной аренды',]},

{ask:'назовите недостаток и слабую сторону ип',
o:[
'финансово-экономическая уязвимость бизнеса сориентированного на одного человека',
'наличие основных и дополнительных участников в форме хозяйствования',
'*ответственность по обязательствам своим имуществом',]},

{ask:'одна из основных групп навыков необходимых предпринимателю',
o:[
'*технологическая',
'дополнительная',
'основная',]},

{ask:'выбери наиболее полное определение коммерческой сделки',
o:[
'соглашение между двумя сторонами осуществляемое в безналичном виде в соответствии с принятыми условиями',
'контракт между несколькими сторонами на поставку товаров без привлечения денежных средств в наличном или безналичном виде',
'индивидуальный трудовой договор',
'*соглашение между двумя или несколькими сторонами на поставку товаров выполнение работ или услуг в соответствии с принятыми условиями',
'соглашение между двумя сторонами об изготовлении продукции',]},

{ask:'укажи хозяйственную операцию сельскохозяйственного предпринимателя который относится к производственному предпринимательству',
o:[
'*приобретение семян',
'рекламная деятельность',
'аренда торговых складов',]},

{ask:'одна из основных групп навыков необходимых предпринимателю',
o:[
'*коммуникация',
'положительная',
'политическая',]},

{ask:'как называется энергичный предприниматель с отрицательной социальной ориентацией',
o:[
'*акула',
'рак',
'дельфин',]},

{ask:'какое из направлений не является направлением государственной поддержки и регулирования предпринимательства',
o:[
'совершенствование нормативной базы по поддержке малого и среднего предпринимательства',
'формирование нормативно правой базы поддержки и развития предпринимательства',
'совершенствование системы финансовой поддержки малого предпринимательства',
'совершенствование налоговой системы рк',
'*формирование государственной программы производства экологически чистых продуктов',]},

{ask:'одна из основных  групп навыков необходимая предпринимателю',
o:[
'концептуальная',
'прибыльная',
'*эконмическая',]},

{ask:'какое направление не обеспечивается за счет развития предпринимательства',
o:[
'сокращение безработицы',
'*повышение интеллектуального уровня населения',
'укрепление экономической и социальной базы регионов',
'повышение жизненного уровня населения',
'увеличение занятости населения',]},

{ask:'разновидность посредников в коммерческих предпринимательстве',
o:[
'брокеры',
'представители',
'*агенты',]},

{ask:'какой вид предпринимательства предусматривает торгово-обменные операции по купле-продаже товаров',
o:[
'финансовое',
'производственное',
'*коммерческое',]},

{ask:'разновидность посредников в финансовом предпринимательстве',
o:[
'*брокеры',
'агенты',
'дилеры',]},

{ask:'предпринимательство - это самостоятельная инициативная деятельность физических и юридических лиц осуществляемая с целью',
o:[
'*получение прибыли',
'удовлетворения амбиций',
'помощи нуждающимся',]},
];	

	const au=document.querySelector('.a5');	
	const k5=document.querySelector('#k5');	
	const tst=au.querySelector('.tst');
	const scat=document.querySelectorAll('.a5, .overlay');
	const cr5js=document.querySelector('.cr5js');
	cr5js.addEventListener('click',()=>{[...scat].forEach(x=>x.classList.toggle('hidden'))});	
	k5.addEventListener('click',()=>{[...scat].forEach(x=>x.classList.toggle('hidden'))});	
	fn(au,a);	
})();